mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/libraries/bootloader_dfu/dfu_transport_ble.c
    // The DFU module accepts the dfu_pkt.packet_length to be in 'number of words'. And so if the
    // received data does not have a size which is a multiple of four, it should be padded with
    // zeros and the packet_length should be incremented accordingly before calling
    // dfu_init_pkt_handle.
    if ((p_evt->evt.ble_dfu_pkt_write.len & (sizeof(uint32_t) - 1)) != 0)
    {
        uint32_t padding;
        uint32_t i;
        uint8_t  pkt_length = p_evt->evt.ble_dfu_pkt_write.len;

        // Find out the number of bytes to be padded.
        padding = sizeof(uint32_t) - (pkt_length & (sizeof(uint32_t) - 1));

        for (i = 0; i < padding; i++)
        {
            p_evt->evt.ble_dfu_pkt_write.p_data[pkt_length++] = 0;
        }

        p_evt->evt.ble_dfu_pkt_write.len = pkt_length;
    }

    dfu_pkt.packet_type = INIT_PACKET;

    dfu_pkt.params.data_packet.p_data_packet = (uint32_t *)p_evt->evt.ble_dfu_pkt_write.p_data;
    dfu_pkt.params.data_packet.packet_length = p_evt->evt.ble_dfu_pkt_write.len / sizeof(uint32_t);

    err_code = dfu_init_pkt_handle(&dfu_pkt);

    // Translate the err_code returned by the above function to DFU Response Value.
    if (err_code != NRF_SUCCESS)
    {
        ble_dfu_resp_val_t resp_val = nrf_err_code_translate(err_code, BLE_DFU_INIT_PROCEDURE);

        err_code = ble_dfu_response_send(p_dfu, BLE_DFU_INIT_PROCEDURE, resp_val);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Pass one word-aligned DATA fragment to the DFU core. */
static bool aligned_data_process(ble_dfu_t * p_dfu, uint8_t const * p_data, uint32_t length)
{
    uint32_t err_code;

    if ((length == 0) || ((length & (sizeof(uint32_t) - 1U)) != 0))
    {
        dfu_error_notify(p_dfu, NRF_ERROR_INVALID_LENGTH);
        return false;
    }

    err_code = hci_mem_pool_rx_produce(length, (void **)&mp_rx_buffer);
    if (err_code != NRF_SUCCESS)
    {
        dfu_error_notify(p_dfu, err_code);
        return false;
    }

    memcpy(mp_rx_buffer, p_data, length);

    err_code = hci_mem_pool_rx_data_size_set(length);
    if (err_code == NRF_SUCCESS)
    {
        err_code = hci_mem_pool_rx_extract(&mp_rx_buffer, &length);
    }
    if (err_code != NRF_SUCCESS)
    {
        dfu_error_notify(p_dfu, err_code);
        return false;
    }

    dfu_update_packet_t dfu_pkt;
    dfu_pkt.packet_type                      = DATA_PACKET;
    dfu_pkt.params.data_packet.packet_length = length / sizeof(uint32_t);
    dfu_pkt.params.data_packet.p_data_packet = (uint32_t *)mp_rx_buffer;

    err_code = dfu_data_pkt_handle(&dfu_pkt);
    if ((err_code == NRF_SUCCESS) || (err_code == NRF_ERROR_INVALID_LENGTH))
    {
        m_num_of_firmware_bytes_rcvd += length;
        if (err_code == NRF_SUCCESS)
        {
            // The asynchronous flash callback sends the final response.
            mp_final_packet = mp_rx_buffer;
        }
        return true;
    }

    uint32_t const hci_error = hci_mem_pool_rx_consume(mp_rx_buffer);
    if (hci_error != NRF_SUCCESS)
    {
        dfu_error_notify(p_dfu, hci_error);
    }
    dfu_error_notify(p_dfu, err_code);
    return false;
}

/**@brief Flush only complete words, retaining a zero-to-three-byte suffix. */
static bool accum_flush(ble_dfu_t * p_dfu)
{
    uint32_t const length = m_accum_len & ~(sizeof(uint32_t) - 1U);
    if (length == 0)
    {
        return true;
    }

    PRINTF("OTA: Flushing accumulator buffer (%ld bytes)\r\n", length);
    if (!aligned_data_process(p_dfu, m_accum_buf, length))
    {
        m_accum_len = 0;
        return false;
    }

    m_accum_len -= length;
    if (m_accum_len != 0)
    {
        memmove(m_accum_buf, m_accum_buf + length, m_accum_len);
    }
    return true;
}

/**@brief Append arbitrary ATT fragments without ever padding the firmware stream. */
static bool accum_append(ble_dfu_t * p_dfu, uint8_t const * p_data, uint16_t length)
{
    while (length != 0)
    {
        uint16_t const available = sizeof(m_accum_buf) - m_accum_len;
        uint16_t const copy_len  = MIN(length, available);

        memcpy(m_accum_buf + m_accum_len, p_data, copy_len);
        m_accum_len += copy_len;
        p_data += copy_len;
        length -= copy_len;

        if ((m_accum_len == sizeof(m_accum_buf)) && !accum_flush(p_dfu))
        {
            return false;
        }
    }
    return true;
}

/**@brief     Function for processing application data written by the peer to the DFU Packet
 *            Characteristic.
 *
 * @param[in] p_dfu     DFU Service Structure.
 * @param[in] p_evt     Pointer to the event received from the S110 SoftDevice.
 */
static void app_data_process(ble_dfu_t * p_dfu, ble_dfu_evt_t * p_evt)
{
    uint32_t err_code;
    uint16_t pkt_len = p_evt->evt.ble_dfu_pkt_write.len;
    uint8_t * p_data = p_evt->evt.ble_dfu_pkt_write.p_data;

    uint32_t const received = m_num_of_firmware_bytes_rcvd + m_accum_len;
    if ((pkt_len == 0) || (received > m_reported_image_size) ||
        (pkt_len > (m_reported_image_size - received)))
    {
        dfu_error_notify(p_dfu, NRF_ERROR_DATA_SIZE);
        return;
    }

    // Check if this is the first data packet and decide whether to accumulate packets
    if (m_num_of_firmware_bytes_rcvd == 0 && m_accum_len == 0)
    {
        m_accum_active = (pkt_len <= ACCUMULATE_THRESHOLD) ||
                         ((pkt_len & (sizeof(uint32_t) - 1U)) != 0);
        PRINTF("OTA: Packet accumulator %s (first packet size %d)\r\n", m_accum_active ? "enabled" : "disabled", pkt_len);
    }

    // Packet sizes can change after MTU renegotiation. Once an odd fragment is
    // seen, keep the stream in accumulation mode so the byte sequence can be
    // reassembled into words without inserting padding between ATT writes.
    if ((pkt_len & (sizeof(uint32_t) - 1U)) != 0)
    {
        m_accum_active = true;
    }

    if (m_accum_active)
    {
        if (!accum_append(p_dfu, p_data, pkt_len))
        {
            return;
        }

        // The START sizes are word-aligned. Reaching the declared byte count
        // with a suffix would therefore indicate stream corruption.
        if ((m_num_of_firmware_bytes_rcvd + m_accum_len) == m_reported_image_size)
        {
            if (!accum_flush(p_dfu))
            {
                return;
            }
            if (m_accum_len != 0)
            {
                dfu_error_notify(p_dfu, NRF_ERROR_INVALID_LENGTH);
            }
            return;
        }

        if (m_pkt_rcpt_notif_enabled)
        {
            m_pkt_notif_target_cnt--;
            if (m_pkt_notif_target_cnt == 0)
            {
                // Commit every complete word before reporting. Any suffix is
                // connection-local and is discarded on a link loss.
                if (!accum_flush(p_dfu))
                {
                    return;
                }
                err_code = ble_dfu_pkts_rcpt_notify(
                    p_dfu, m_num_of_firmware_bytes_rcvd + m_accum_len);
                APP_ERROR_CHECK(err_code);
                m_pkt_notif_target_cnt = m_pkt_notif_target;
            }
        }
        return;
    }

    if (!aligned_data_process(p_dfu, p_data, pkt_len))
    {
        return;
    }

    if ((m_num_of_firmware_bytes_rcvd < m_reported_image_size) &&
        m_pkt_rcpt_notif_enabled)
    {
        m_pkt_notif_target_cnt--;
        if (m_pkt_notif_target_cnt == 0)
        {
            err_code = ble_dfu_pkts_rcpt_notify(p_dfu, m_num_of_firmware_bytes_rcvd);
            APP_ERROR_CHECK(err_code);
            m_pkt_notif_target_cnt = m_pkt_notif_target;
        }
    }
}


/**@brief     Function for processing data written by the peer to the DFU Packet Characteristic.
 *
 * @param[in] p_dfu     DFU Service Structure.
 * @param[in] p_evt     Pointer to the event received from the S110 SoftDevice.
 */
static void on_dfu_pkt_write(ble_dfu_t * p_dfu, ble_dfu_evt_t * p_evt)
{
    // The peer has written to the DFU Packet characteristic. Depending on the value of
    // the current value of the DFU Control Point, the appropriate action is taken.
    switch (m_pkt_type)
    {
        case PKT_TYPE_START:
            // The peer has written a start packet to the DFU Packet characteristic.
            start_data_process(p_dfu, p_evt);
            break;

        case PKT_TYPE_INIT:
            // The peer has written an init packet to the DFU Packet characteristic.
            init_data_process(p_dfu, p_evt);
            break;

        case PKT_TYPE_FIRMWARE_DATA:
            app_data_process(p_dfu, p_evt);
            break;

        default:
            // It is not possible to find out what packet it is. Ignore. There is no
            // mechanism to notify the DFU Controller about this error condition.
            break;
    }
}

