mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/libraries/bootloader_dfu/dfu_transport_ble.c
        case BLE_GAP_EVT_CONN_SEC_UPDATE:
            // Encryption or an ATT MTU exchange may temporarily block the
            // indication. A disabled CCCD must not add work to every packet.
            service_change_try();
            break;

        case BLE_GAP_EVT_AUTH_STATUS:
            // No implementation needed.
            break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
          // This negotiation is optional. Let the SoftDevice choose supported
          // values, but never reset DFU for a transient BUSY/RESOURCES result.
          (void) sd_ble_gap_data_length_update(m_conn_handle, NULL, NULL);
        break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
          // Tell SoftDevice to choose PHY automatically
          ble_gap_phys_t phy = { BLE_GAP_PHY_AUTO, BLE_GAP_PHY_AUTO };
          (void) sd_ble_gap_phy_update(m_conn_handle, &phy);
        }
        break;

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
        {
          uint16_t att_mtu = MIN(p_ble_evt->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu, BLEGATT_ATT_MTU_MAX);

          // Choose the largest <= requested MTU whose ATT payload is word-aligned.
          att_mtu = ((att_mtu - 3U) & 0xFFFCU) + 3U;

          PRINTF("GAP ATT MTU is changed to %d\r\n", att_mtu);
          // A rejected MTU extension leaves the mandatory default MTU usable.
          (void) sd_ble_gatts_exchange_mtu_reply(m_conn_handle, att_mtu);
          service_change_try();
        }
        break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief     Function for dispatching a S110 SoftDevice event to all modules with a S110
 *            SoftDevice event handler.
 *
 * @details   This function is called from the S110 SoftDevice event interrupt handler after a
 *            S110 SoftDevice event has been received.
 *
 * @param[in] p_ble_evt S110 SoftDevice event.
 */
/*static*/ void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
#ifdef SECURE_DFU_TEST
    secure_dfu_ble_event(&m_dfu, p_ble_evt);
#else
    ble_dfu_on_ble_evt(&m_dfu, p_ble_evt);
#endif
    on_ble_evt(p_ble_evt);
}

#ifdef SECURE_DFU_TEST
void dfu_transport_ble_poll(void) {
    if (IS_CONNECTED() && !m_tear_down_in_progress) secure_dfu_ble_poll(&m_dfu);
}

void dfu_secure_connection_policy(bool writing) {
    if (writing) prioritize_flash_writes_over_ble();
    else prioritize_ble_over_flash_writes();
}
#endif

/**@brief     Function for the GAP initialization.
 *
 * @details   This function will setup all the necessary GAP (Generic Access Profile) parameters of
 *            the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief     Function for handling Service errors.
 *
 * @details   A pointer to this function will be passed to the DFU service which may need to inform
 *            the application about an error.
 *
 * @param[in] nrf_error Error code containing information about what went wrong.
 */
__attribute__((unused))
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


static void dis_string_add(uint16_t service_handle,
                           uint16_t uuid,
                           char const * p_string,
                           uint16_t length)
{
    ble_gatts_char_md_t char_md = {0};
    char_md.char_props.read = 1;

    ble_gatts_attr_md_t attr_md = {0};
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attr_md.write_perm);
    attr_md.vloc = BLE_GATTS_VLOC_STACK;

    ble_uuid_t value_uuid = {
        .uuid = uuid,
        .type = BLE_UUID_TYPE_BLE,
    };
    ble_gatts_attr_t value = {
        .p_uuid = &value_uuid,
        .p_attr_md = &attr_md,
        .init_len = length,
        .max_len = length,
        .p_value = (uint8_t *)p_string,
    };
    ble_gatts_char_handles_t handles;
    APP_ERROR_CHECK(sd_ble_gatts_characteristic_add(service_handle, &char_md,
                                                     &value, &handles));
}

static void device_information_init(void)
{
    ble_uuid_t service_uuid = {
        .uuid = BLE_UUID_DEVICE_INFORMATION_SERVICE,
        .type = BLE_UUID_TYPE_BLE,
    };
    uint16_t service_handle;
    APP_ERROR_CHECK(sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                              &service_uuid,
                                              &service_handle));

    // Preserve the historical attribute order. Bonded phones and BlueZ cache
    // these value handles: manufacturer 0x0018, model 0x001A, firmware 0x001C.
    dis_string_add(service_handle, BLE_UUID_MANUFACTURER_NAME_STRING_CHAR,
                   BLEDIS_MANUFACTURER, sizeof(BLEDIS_MANUFACTURER) - 1U);
    dis_string_add(service_handle, BLE_UUID_MODEL_NUMBER_STRING_CHAR,
                   BLEDIS_MODEL, sizeof(BLEDIS_MODEL) - 1U);
    dis_string_add(service_handle, BLE_UUID_FIRMWARE_REVISION_STRING_CHAR,
                   BLEDIS_FW_VERSION, sizeof(BLEDIS_FW_VERSION) - 1U);
}

/**@brief     Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
#ifdef SECURE_DFU_TEST
    APP_ERROR_CHECK(secure_dfu_ble_init(&m_dfu));
#else
    uint32_t       err_code;
    ble_dfu_init_t dfu_init_obj;

    // Initialize the Device Firmware Update Service.
    memset(&dfu_init_obj, 0, sizeof(dfu_init_obj));

    dfu_init_obj.revision      = DFU_REVISION;
    dfu_init_obj.evt_handler   = on_dfu_evt;
    dfu_init_obj.error_handler = service_error_handler;

    err_code = ble_dfu_init(&m_dfu, &dfu_init_obj);
    APP_ERROR_CHECK(err_code);

#endif
    // Keep the legacy DIS attribute layout stable for bonded/cacheing clients.
    device_information_init();

